-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 23, 2021 at 07:09 PM
-- Server version: 10.4.18-MariaDB
-- PHP Version: 7.3.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `nd_apartments`
--

-- --------------------------------------------------------

--
-- Table structure for table `sales`
--

CREATE TABLE `sales` (
  `ID` int(3) NOT NULL,
  `START_DATE` date DEFAULT NULL,
  `CONTRACT_NUMBER` varchar(7) DEFAULT NULL,
  `CONTRACT_TYPE` varchar(15) DEFAULT NULL,
  `SALES_MANAGER` varchar(16) DEFAULT NULL,
  `PAID` int(6) DEFAULT NULL,
  `SALE_TYPE` varchar(9) DEFAULT NULL,
  `PURCHASE_TYPE` varchar(15) DEFAULT NULL,
  `INTERMEDIARY` varchar(10) DEFAULT NULL,
  `COMMISSION_TYPE` varchar(7) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `sales`
--

INSERT INTO `sales` (`ID`, `START_DATE`, `CONTRACT_NUMBER`, `CONTRACT_TYPE`, `SALES_MANAGER`, `PAID`, `SALE_TYPE`, `PURCHASE_TYPE`, `INTERMEDIARY`, `COMMISSION_TYPE`) VALUES
(1, '2019-07-24', 'R295', 'კარკასი', 'გრიგოლ ჩაჩუა', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(2, '2020-02-12', 'W381', 'კარკასი', 'ია გოგიძე', 40667, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(3, '2020-05-06', 'R294', 'კარკასი', 'ელიზა დავითაძე', 48722, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(4, '2021-05-25', 'R293', 'კარკასი', 'გრიგოლ ჩაჩუა', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(5, '2017-12-15', 'R292', 'კარკასი', 'ია გოგიძე', 73071, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(6, '2020-06-19', 'R291', 'კარკასი', 'გიორგი სტაცენკო', 47582, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(7, '2018-10-15', 'R289', 'კარკასი', 'ია გოგიძე', 66138, 'შიდა', 'განვადება', NULL, NULL),
(8, '2020-02-24', 'R288', 'კარკასი', 'გიორგი სტაცენკო', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(9, '2019-03-08', 'W003(P)', 'კარკასი', 'გრიგოლ ჩაჩუა', 70482, 'შიდა', 'განვადება', NULL, NULL),
(10, '2018-08-11', 'W380', 'კარკასი+რემონტი', 'გრიგოლ ჩაჩუა', 19836, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(11, '2021-07-16', 'W379', 'კარკასი+რემონტი', 'გრიგოლ ჩაჩუა', 92817, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(12, '2018-10-28', 'W378', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 50517, 'შიდა', 'განვადება', NULL, NULL),
(13, '2020-11-23', 'W377', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 64682, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(14, '2019-11-23', 'R286', 'კარკასი', 'ელიზა დავითაძე', 93953, 'ინსაიდერი', 'განვადება', NULL, NULL),
(15, '2019-08-01', 'W374', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 66966, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(16, '2019-08-26', 'R285', 'კარკასი', 'გრიგოლ ჩაჩუა', 80028, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(17, '2020-05-24', 'R284', 'კარკასი', 'გრიგოლ ჩაჩუა', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(18, '2018-09-01', 'R283', 'კარკასი', 'გრიგოლ ჩაჩუა', 92267, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(19, '2018-02-14', 'R282', 'კარკასი', 'გრიგოლ ჩაჩუა', 65548, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(20, '2017-11-09', 'R281', 'კარკასი', 'Dmitrii Kiktev', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(21, '2020-07-08', 'R280', 'კარკასი', 'Dmitrii Kiktev', 58078, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(22, '2017-10-05', 'R279', 'კარკასი', 'Dmitrii Kiktev', 71045, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(23, '2019-06-29', 'R278', 'კარკასი', 'ჯულიეტ ბაგრამიან', 44952, 'შიდა', 'განვადება', NULL, NULL),
(24, '2020-11-30', '415', 'კარკასი', 'ჯულიეტ ბაგრამიან', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(25, '2021-02-04', 'R270', 'კარკასი', 'ელიზა დავითაძე', 82819, 'შიდა', 'განვადება', NULL, NULL),
(26, '2018-08-28', 'R269', 'კარკასი', 'გრიგოლ ჩაჩუა', 50879, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(27, '2017-11-26', 'W372', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 86998, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(28, '2020-07-15', 'R268', 'კარკასი', 'ნინო ქათამაძე', 20558, 'შიდა', 'განვადება', NULL, NULL),
(29, '2021-06-08', 'R267', 'კარკასი', 'ნინო ბაკურიძე', 86419, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(30, '2019-05-07', 'W370', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 71827, 'ინსაიდერი', 'განვადება', NULL, NULL),
(31, '2019-09-27', 'R266', 'კარკასი', 'ელიზა დავითაძე', 92957, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(32, '2020-02-20', 'W365', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 12987, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(33, '2017-07-02', 'W364', 'კარკასი', 'ნინო ბაკურიძე', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(34, '2021-07-20', 'R265', 'კარკასი', 'გრიგოლ ჩაჩუა', 38753, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(35, '2020-08-27', '412', 'კარკასი', 'გრიგოლ ჩაჩუა', 86970, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(36, '2019-06-26', '413', 'კარკასი', 'გრიგოლ ჩაჩუა', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(37, '2020-07-18', 'R264', 'კარკასი', 'ელიზა დავითაძე', 32172, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(38, '2018-11-30', 'R262', 'კარკასი', 'ია გოგიძე', 94078, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(39, '2020-09-18', 'R263', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 48465, 'შიდა', 'განვადება', NULL, NULL),
(40, '2019-09-10', 'W361', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(41, '2017-11-25', 'R258', 'კარკასი', 'ნინო ბაკურიძე', 67702, 'შიდა', 'განვადება', NULL, NULL),
(42, '2020-10-07', 'R257', 'კარკასი', 'ია გოგიძე', 26067, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(43, '2021-04-26', '414', 'კარკასი', 'ნინო ბაკურიძე', 68923, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(44, '2017-12-23', 'R255', 'კარკასი', 'ელიზა დავითაძე', 88494, 'შიდა', 'განვადება', NULL, NULL),
(45, '2021-01-31', 'R256', 'კარკასი', 'ნინო ქათამაძე', 33902, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(46, '2021-05-07', 'W360', 'კარკასი', 'ნინო ბაკურიძე', 90240, 'ინსაიდერი', 'განვადება', NULL, NULL),
(47, '2019-02-14', 'R253', 'კარკასი', 'ელიზა დავითაძე', 66405, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(48, '2019-01-07', 'W359', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 52869, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(49, '2020-12-20', 'R252', 'კარკასი', 'ნინო ბაკურიძე', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(50, '2020-05-20', 'W357', 'კარკასი', 'ნინო ბაკურიძე', 73044, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(51, '2020-10-17', 'R251', 'კარკასი', 'ჯულიეტ ბაგრამიან', 69014, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(52, '2021-03-30', '411', 'კარკასი', 'ჯულიეტ ბაგრამიან', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(53, '2019-11-26', 'R250', 'კარკასი', 'გრიგოლ ჩაჩუა', 39269, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(54, '2019-06-12', 'W356', 'კარკასი', 'ნინო ბაკურიძე', 88476, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(55, '2020-02-01', 'W355', 'კარკასი', 'ნინო ბაკურიძე', 10878, 'შიდა', 'განვადება', NULL, NULL),
(56, '2019-04-19', 'W354', 'კარკასი', 'ნინო ბაკურიძე', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(57, '2018-03-25', 'R249', 'კარკასი+რემონტი', 'გრიგოლ ჩაჩუა', 62125, 'შიდა', 'განვადება', NULL, NULL),
(58, '2020-06-28', 'W353', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 33699, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(59, '2019-03-18', 'R246', 'კარკასი', 'გრიგოლ ჩაჩუა', 72698, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(60, '2018-10-18', 'W350', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 68410, 'შიდა', 'განვადება', NULL, NULL),
(61, '2019-01-19', 'W351', 'კარკასი', 'ნინო ბაკურიძე', 76197, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(62, '2017-06-12', 'R245', 'კარკასი', 'ჯულიეტ ბაგრამიან', 91989, 'ინსაიდერი', 'განვადება', NULL, NULL),
(63, '2018-04-26', 'W352', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 39948, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(64, '2019-06-25', 'R242', 'კარკასი', 'ჯულიეტ ბაგრამიან', 90413, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(65, '2018-12-15', 'R243', 'კარკასი', 'ნინო ქათამაძე', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(66, '2020-03-30', 'R241', 'კარკასი', 'ია გოგიძე', 38098, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(67, '2019-01-20', 'R248', 'კარკასი', 'ნინო ქათამაძე', 91008, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(68, '2020-03-03', 'W348', 'კარკასი+რემონტი', 'გრიგოლ ჩაჩუა', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(69, '2020-04-05', 'W349', 'კარკასი', 'ნინო ბაკურიძე', 67376, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(70, '2020-07-04', 'R239', 'კარკასი', 'ია გოგიძე', 96897, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(71, '2019-11-02', 'R240', 'კარკასი', 'ია გოგიძე', 72995, 'შიდა', 'განვადება', NULL, NULL),
(72, '2017-08-11', 'R237', 'კარკასი', 'ნინო ბაკურიძე', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(73, '2018-05-15', 'R236', 'კარკასი', 'ელიზა დავითაძე', 35124, 'შიდა', 'განვადება', NULL, NULL),
(74, '2020-12-26', 'R235', 'კარკასი', 'ელიზა დავითაძე', 96031, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(75, '2018-11-24', 'R234', 'კარკასი', 'გრიგოლ ჩაჩუა', 14653, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(76, '2018-04-12', 'R232', 'კარკასი', 'ია გოგიძე', 26560, 'შიდა', 'განვადება', NULL, NULL),
(77, '2019-02-13', 'R231', 'კარკასი', 'გრიგოლ ჩაჩუა', 22606, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(78, '2020-10-29', 'R230', 'კარკასი', 'გრიგოლ ჩაჩუა', 62647, 'ინსაიდერი', 'განვადება', NULL, NULL),
(79, '2019-08-30', 'W347', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 28170, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(80, '2019-04-05', 'R229', 'კარკასი', 'ჯულიეტ ბაგრამიან', 50703, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(81, '2019-07-06', 'R233', 'კარკასი', 'ნინო ბაკურიძე', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(82, '2019-03-03', 'R227', 'კარკასი', 'ნინო ბაკურიძე', 67236, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(83, '2021-06-26', 'W346', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 56976, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(84, '2019-08-18', 'W344', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3'),
(85, '2021-03-25', 'W345', 'კარკასი+რემონტი', 'ნინო ბაკურიძე', 66185, 'მაკლერი', 'განვადება', 'მაკლერი 3', 'წესი #7'),
(86, '2021-02-15', 'R225', 'კარკასი', 'ჯულიეტ ბაგრამიან', 95051, 'ინსაიდერი', 'ერთიანი გადახდა', NULL, NULL),
(87, '2019-01-10', 'R224', 'კარკასი', 'ჯულიეტ ბაგრამიან', 48948, 'შიდა', 'განვადება', NULL, NULL),
(88, '2018-12-01', 'R222', 'კარკასი', 'ელიზა დავითაძე', 130000, 'შიდა', 'ერთიანი გადახდა', NULL, NULL),
(89, '2020-10-29', 'R223', 'კარკასი', 'ჯულიეტ ბაგრამიან', 59647, 'შიდა', 'განვადება', NULL, NULL),
(90, '2019-01-28', 'R221', 'კარკასი', 'ჯულიეტ ბაგრამიან', 21091, 'მაკლერი', 'განვადება', 'მაკლერი 10', 'წესი #6'),
(91, '2020-03-02', 'W343', 'კარკასი+რემონტი', 'ია გოგიძე', 79180, 'მაკლერი', 'განვადება', 'მაკლერი 4', 'წესი #5'),
(92, '2019-08-21', 'R219', 'კარკასი', 'ჯულიეტ ბაგრამიან', 98709, 'შიდა', 'განვადება', NULL, NULL),
(93, '2019-02-24', 'R218', 'კარკასი', 'ია გოგიძე', 92525, 'მაკლერი', 'განვადება', 'მაკლერი 9', 'წესი #2'),
(94, '2017-06-25', 'R217', 'კარკასი', 'Dmitrii Kiktev', 94697, 'ინსაიდერი', 'განვადება', NULL, NULL),
(95, '2020-03-21', 'W342', 'კარკასი+რემონტი', 'Dmitrii Kiktev', 16633, 'მაკლერი', 'განვადება', 'მაკლერი 5', 'წესი #4'),
(96, '2019-11-24', 'R215', 'კარკასი', 'ნინო ბაკურიძე', 30911, 'მაკლერი', 'განვადება', 'მაკლერი 7', 'წესი #7'),
(97, '2018-12-22', 'W341', 'კარკასი+რემონტი', 'გრიგოლ ჩაჩუა', 100000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 1', 'წესი #1'),
(98, '2017-12-20', 'R214', 'კარკასი', 'ნინო ქათამაძე', 49049, 'მაკლერი', 'განვადება', 'მაკლერი 8', 'წესი #2'),
(99, '2020-01-23', 'W002(P)', 'კარკასი', 'ნინო ბაკურიძე', 49794, 'მაკლერი', 'განვადება', 'მაკლერი 2', 'წესი #4'),
(100, '2017-09-13', 'R216', 'კარკასი', 'ნინო ქათამაძე', 150000, 'მაკლერი', 'ერთიანი გადახდა', 'მაკლერი 6', 'წესი #3');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sales`
--
ALTER TABLE `sales`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sales`
--
ALTER TABLE `sales`
  MODIFY `ID` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
